---
title: VMware Tanzu GemfireをRocky Linuxにインストールするメモ
tags: ["Gemfire", "OrbStack", "Tanzu", "Rocky"]
categories: ["Middleware", "DistributedSystem", "InMemoryDataGrid", "Gemfire"]
---

VMware Tanzu GemfireをRocky Linuxにインストールします。

この記事ではRocky Linux環境として、[OrbStack](https://orbstack.dev/)の[Linux Machine](https://docs.orbstack.dev/machines/)を使用します。



### Linux Machineの作成

```yaml
cat <<'EOF' > cloud-init-gemfire.yaml
#cloud-config

packages:
  - java-21-openjdk-devel
  - curl
  - wget
  - zip
  - unzip
  - lsof

write_files:
  - path: /etc/profile.d/java.sh
    content: |
      export JAVA_HOME=/usr/lib/jvm/java
      export PATH=$PATH:$JAVA_HOME/bin
    permissions: '0644'
    owner: root:root
  - path: /etc/profile.d/gemfire.sh
    content: |
      export GEMFIRE_HOME=/Users/toshiaki/gemfire/vmware-gemfire-10.1.3
      export PATH=$PATH:$GEMFIRE_HOME/bin
    permissions: '0644'
    owner: root:root
  - path: /etc/sysctl.d/99-gemfire.conf
    content: |
      net.ipv4.tcp_syncookies=0
    permissions: '0644'
    owner: root:root

runcmd:
  - groupadd -r gemfire
  - useradd -r -g gemfire -d /opt/gemfire -s /bin/bash gemfire
  - mkdir -p /opt/gemfire
  - chown -R gemfire:gemfire /opt/gemfire
  - sysctl -p /etc/sysctl.d/99-gemfire.conf

package_update: true
package_upgrade: false
EOF
```


```bash
orb create rocky:8 gemfire-locator-1 -c cloud-init-gemfire.yaml
```

```bash
orbctl clone gemfire-locator-1 gemfire-locator-2
orbctl clone gemfire-locator-1 gemfire-server-1
orbctl clone gemfire-locator-1 gemfire-server-2
orbctl clone gemfire-locator-1 gemfire-server-3

orbctl start gemfire-locator-2
orbctl start gemfire-server-1
orbctl start gemfire-server-2
orbctl start gemfire-server-3
```


```bash
orb -m gemfire-locator-1 -u gemfire gfsh start locator --name=locator-1 --port=10334 --hostname-for-clients=gemfire-locator-1.orb.local --jmx-manager-hostname-for-clients=gemfire-locator-1.orb.local --locators="gemfire-locator-1.orb.local[10334],gemfire-locator-2.orb.local[10334]" --max-heap=4g --dir=/opt/gemfire
```

```bash
orb -m gemfire-locator-2 -u gemfire gfsh start locator --name=locator-2 --port=10334 --hostname-for-clients=gemfire-locator-2.orb.local --jmx-manager-hostname-for-clients=gemfire-locator-1.orb.local --locators="gemfire-locator-1.orb.local[10334],gemfire-locator-2.orb.local[10334]" --max-heap=4g --dir=/opt/gemfire
```


```bash
$ orb -m gemfire-locator-1 -u gemfire gfsh -e 'connect --locator=gemfire-locator-1.orb.local[10334]' -e 'list members'



(1) Executing - connect --locator=gemfire-locator-1.orb.local[10334]

Connecting to Locator at [host=gemfire-locator-1.orb.local, port=10334] ..
Connecting to Manager at [host=gemfire-locator-1.orb.local, port=1099] ..
Successfully connected to: [host=gemfire-locator-1.orb.local, port=1099]

You are connected to a cluster of version 10.1.3.


(2) Executing - list members

Member Count : 2

  Name    |                                 Id                                 |  Type   | Status
--------- | ------------------------------------------------------------------ | ------- | ------
locator-1 | 198.19.249.204(locator-1:2234:locator)<ec><v0>:58297 [Coordinator] | Locator | Ready
locator-2 | 198.19.249.17(locator-2:2250:locator)<ec><v5>:55079                | Locator | Ready
```


```bash
orb -m gemfire-server-1 -u gemfire gfsh start server --name=server-1 --locators="gemfire-locator-1.orb.local[10334],gemfire-locator-2.orb.local[10334]" --hostname-for-clients=gemfire-server-1.orb.local --jmx-manager-hostname-for-clients=gemfire-server-1.orb.local --max-heap=4g --dir=/opt/gemfire
orb -m gemfire-server-2 -u gemfire gfsh start server --name=server-2 --locators="gemfire-locator-1.orb.local[10334],gemfire-locator-2.orb.local[10334]" --hostname-for-clients=gemfire-server-2.orb.local --jmx-manager-hostname-for-clients=gemfire-server-2.orb.local --max-heap=4g --dir=/opt/gemfire
orb -m gemfire-server-3 -u gemfire gfsh start server --name=server-3 --locators="gemfire-locator-1.orb.local[10334],gemfire-locator-2.orb.local[10334]" --hostname-for-clients=gemfire-server-3.orb.local --jmx-manager-hostname-for-clients=gemfire-server-3.orb.local --max-heap=4g --dir=/opt/gemfire
```


```bash
$ orb -m gemfire-locator-1 -u gemfire gfsh -e 'connect --locator=gemfire-locator-1.orb.local[10334]' -e 'list members'

(1) Executing - connect --locator=gemfire-locator-1.orb.local[10334]

Connecting to Locator at [host=gemfire-locator-1.orb.local, port=10334] ..
Connecting to Manager at [host=gemfire-locator-1.orb.local, port=1099] ..
Successfully connected to: [host=gemfire-locator-1.orb.local, port=1099]

You are connected to a cluster of version 10.1.3.


(2) Executing - list members

Member Count : 5

  Name    |                                 Id                                 |  Type   | Status
--------- | ------------------------------------------------------------------ | ------- | ------
locator-1 | 198.19.249.204(locator-1:2234:locator)<ec><v0>:58297 [Coordinator] | Locator | Ready
locator-2 | 198.19.249.17(locator-2:2250:locator)<ec><v5>:55079                | Locator | Ready
server-1  | 198.19.249.223(server-1:880)<v6>:51031                             | Server  | Ready
server-2  | 198.19.249.93(server-2:811)<v7>:47742                              | Server  | Ready
server-3  | 198.19.249.81(server-3:770)<v8>:59550                              | Server  | Ready
```

```bash
orb -m gemfire-locator-1 -u gemfire gfsh
```

```bash
connect --locator=gemfire-locator-1.orb.local[10334]
```

```bash
create region --name demo --type=PARTITION_PERSISTENT --redundant-copies=1

put --region=/demo --key=aaa --value=1
put --region=/demo --key=bbb --value=2
put --region=/demo --key=ccc --value=3
put --region=/demo --key=ddd --value=4
put --region=/demo --key=eee --value=5
```

```bash
gfsh>query --query="SELECT * FROM /demo"
Result : true
Limit  : 100
Rows   : 5

Result
------
3
5
2
1
4
```


```bash
gfsh>locate entry --region=/demo --key=aaa
Result          : true
Key Class       : java.lang.String
Key             : aaa
Locations Found : 2

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-3   | 198.19.249.118(server-3:768)<v4>:55213 | *Primary PR* | 45
server-2   | 198.19.249.129(server-2:820)<v3>:43383 | No           | 45

gfsh>locate entry --region=/demo --key=bbb
Result          : true
Key Class       : java.lang.String
Key             : bbb
Locations Found : 2

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-2   | 198.19.249.129(server-2:820)<v3>:43383 | *Primary PR* | 21
server-1   | 198.19.249.241(server-1:877)<v2>:53253 | No           | 21

gfsh>locate entry --region=/demo --key=ccc
Result          : true
Key Class       : java.lang.String
Key             : ccc
Locations Found : 2

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-3   | 198.19.249.118(server-3:768)<v4>:55213 | No           | 110
server-1   | 198.19.249.241(server-1:877)<v2>:53253 | *Primary PR* | 110

gfsh>locate entry --region=/demo --key=ddd
Result          : true
Key Class       : java.lang.String
Key             : ddd
Locations Found : 2

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-1   | 198.19.249.241(server-1:877)<v2>:53253 | No           | 86
server-2   | 198.19.249.129(server-2:820)<v3>:43383 | *Primary PR* | 86

gfsh>locate entry --region=/demo --key=eee
Result          : true
Key Class       : java.lang.String
Key             : eee
Locations Found : 2

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-3   | 198.19.249.118(server-3:768)<v4>:55213 | *Primary PR* | 62
server-1   | 198.19.249.241(server-1:877)<v2>:53253 | No           | 62
```

```bash
stop server --name=server-1
```

```bash
gfsh>query --query="SELECT * FROM /demo"
Result : true
Limit  : 100
Rows   : 5

Result
------
3
5
2
1
4
```


```bash
gfsh>locate entry --region=/demo --key=aaa
Result          : true
Key Class       : java.lang.String
Key             : aaa
Locations Found : 2

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-3   | 198.19.249.118(server-3:768)<v4>:55213 | *Primary PR* | 45
server-2   | 198.19.249.129(server-2:820)<v3>:43383 | No           | 45

gfsh>locate entry --region=/demo --key=bbb
Result          : true
Key Class       : java.lang.String
Key             : bbb
Locations Found : 1

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-2   | 198.19.249.129(server-2:820)<v3>:43383 | *Primary PR* | 21

gfsh>locate entry --region=/demo --key=ccc
Result          : true
Key Class       : java.lang.String
Key             : ccc
Locations Found : 1

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-3   | 198.19.249.118(server-3:768)<v4>:55213 | *Primary PR* | 110

gfsh>locate entry --region=/demo --key=ddd
Result          : true
Key Class       : java.lang.String
Key             : ddd
Locations Found : 1

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-2   | 198.19.249.129(server-2:820)<v3>:43383 | *Primary PR* | 86

gfsh>locate entry --region=/demo --key=eee
Result          : true
Key Class       : java.lang.String
Key             : eee
Locations Found : 1

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-3   | 198.19.249.118(server-3:768)<v4>:55213 | *Primary PR* | 62
```

```bash
rebalance --include-region=/demo
```

```bash
gfsh>locate entry --region=/demo --key=aaa
Result          : true
Key Class       : java.lang.String
Key             : aaa
Locations Found : 2

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-2   | 198.19.249.129(server-2:820)<v3>:43383 | No           | 45
server-3   | 198.19.249.118(server-3:768)<v4>:55213 | *Primary PR* | 45

gfsh>locate entry --region=/demo --key=bbb
Result          : true
Key Class       : java.lang.String
Key             : bbb
Locations Found : 2

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-2   | 198.19.249.129(server-2:820)<v3>:43383 | *Primary PR* | 21
server-3   | 198.19.249.118(server-3:768)<v4>:55213 | No           | 21

gfsh>locate entry --region=/demo --key=ccc
Result          : true
Key Class       : java.lang.String
Key             : ccc
Locations Found : 2

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-2   | 198.19.249.129(server-2:820)<v3>:43383 | No           | 110
server-3   | 198.19.249.118(server-3:768)<v4>:55213 | *Primary PR* | 110

gfsh>locate entry --region=/demo --key=ddd
Result          : true
Key Class       : java.lang.String
Key             : ddd
Locations Found : 2

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-2   | 198.19.249.129(server-2:820)<v3>:43383 | *Primary PR* | 86
server-3   | 198.19.249.118(server-3:768)<v4>:55213 | No           | 86

gfsh>locate entry --region=/demo --key=eee
Result          : true
Key Class       : java.lang.String
Key             : eee
Locations Found : 2

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-3   | 198.19.249.118(server-3:768)<v4>:55213 | *Primary PR* | 62
server-2   | 198.19.249.129(server-2:820)<v3>:43383 | No           | 62
```

```bash
orb -m gemfire-server-1 -u gemfire gfsh start server --name=server-1 --locators="gemfire-locator-1.orb.local[10334],gemfire-locator-2.orb.local[10334]" --hostname-for-clients=gemfire-server-1.orb.local --jmx-manager-hostname-for-clients=gemfire-server-1.orb.local --max-heap=4g --dir=/opt/gemfire
```

```bash
gfsh>show metrics --member=server-1 --categories=region
Member Metrics

Category |            Metric            | Value
-------- | ---------------------------- | -----
region   | totalRegionCount             | 1
         | listOfRegions                | demo
         | rootRegions                  | /demo
         | totalRegionEntryCount        | 0
         | totalBucketCount             | 0
         | totalPrimaryBucketCount      | 0
         | getsAvgLatency               | 0
         | putsAvgLatency               | 0
         | createsRate                  | 0.0
         | destroyRate                  | 0.0
         | putAllAvgLatency             | 0
         | totalMissCount               | 0
         | totalHitCount                | 0
         | getsRate                     | 0.0
         | putsRate                     | 0.0
         | cacheWriterCallsAvgLatency   | 0
         | cacheListenerCallsAvgLatency | 3208
         | totalLoadsCompleted          | 0
```

```bash
gfsh>show metrics --member=server-1 --categories=region
Member Metrics

Category |            Metric            | Value
-------- | ---------------------------- | -----
region   | totalRegionCount             | 1
         | listOfRegions                | demo
         | rootRegions                  | /demo
         | totalRegionEntryCount        | 2
         | totalBucketCount             | 110
         | totalPrimaryBucketCount      | 38
         | getsAvgLatency               | 0
         | putsAvgLatency               | 0
         | createsRate                  | 0.0
         | destroyRate                  | 0.0
         | putAllAvgLatency             | 0
         | totalMissCount               | 0
         | totalHitCount                | 0
         | getsRate                     | 0.0
         | putsRate                     | 0.0
         | cacheWriterCallsAvgLatency   | 0
         | cacheListenerCallsAvgLatency | 3208
         | totalLoadsCompleted          | 0
```


```bash
gfsh>locate entry --region=/demo --key=aaa
Result          : true
Key Class       : java.lang.String
Key             : aaa
Locations Found : 2

MemberName |                MemberId                 |   Primary    | BucketId
---------- | --------------------------------------- | ------------ | --------
server-3   | 198.19.249.118(server-3:768)<v4>:55213  | *Primary PR* | 45
server-1   | 198.19.249.241(server-1:1402)<v6>:43416 | No           | 45

gfsh>locate entry --region=/demo --key=bbb
Result          : true
Key Class       : java.lang.String
Key             : bbb
Locations Found : 2

MemberName |                MemberId                 |   Primary    | BucketId
---------- | --------------------------------------- | ------------ | --------
server-2   | 198.19.249.129(server-2:820)<v3>:43383  | *Primary PR* | 21
server-1   | 198.19.249.241(server-1:1402)<v6>:43416 | No           | 21

gfsh>locate entry --region=/demo --key=ccc
Result          : true
Key Class       : java.lang.String
Key             : ccc
Locations Found : 2

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-3   | 198.19.249.118(server-3:768)<v4>:55213 | *Primary PR* | 110
server-2   | 198.19.249.129(server-2:820)<v3>:43383 | No           | 110

gfsh>locate entry --region=/demo --key=ddd
Result          : true
Key Class       : java.lang.String
Key             : ddd
Locations Found : 2

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-3   | 198.19.249.118(server-3:768)<v4>:55213 | No           | 86
server-2   | 198.19.249.129(server-2:820)<v3>:43383 | *Primary PR* | 86

gfsh>locate entry --region=/demo --key=eee
Result          : true
Key Class       : java.lang.String
Key             : eee
Locations Found : 2

MemberName |                MemberId                |   Primary    | BucketId
---------- | -------------------------------------- | ------------ | --------
server-2   | 198.19.249.129(server-2:820)<v3>:43383 | No           | 62
server-3   | 198.19.249.118(server-3:768)<v4>:55213 | *Primary PR* | 62
```

```bash
orb -m gemfire-locator-1 -u gemfire gfsh -e 'connect --locator=gemfire-locator-1.orb.local[10334]' -e 'shutdown --include-locators=true'
```


```bash
orbctl delete gemfire-server-1 -f
orbctl delete gemfire-server-2 -f
orbctl delete gemfire-server-3 -f
orbctl delete gemfire-locator-1 -f
orbctl delete gemfire-locator-2 -f
```